[
  {
    "id": 1,
    "title": "Cep",
    "edibility": "Edible",
    "image": "https://raw.githubusercontent.com/Nastasyma/mock-server-api-nastasyma/main/public/assets/images/cep.jpg",
    "habitat": "Coniferous and mixed forests",
    "season": "June - September",
    "description": "The most colorful representative of the mushroom kingdom. According to some sources, it earned its name because its flesh remains marbled white even after cooking. Cep (Boletus edulis) is a type of edible mushroom that is highly prized for its flavour and culinary uses. It is also known by various other names, including king bolete, penny bun, and porcino mushroom. The term 'cep' is more commonly used in the UK and other European countries, while 'porcini' is the Italian name for the mushroom."
  },
  {
    "id": 2,
    "title": "Chanterelle",
    "edibility": "Edible",
    "image": "https://raw.githubusercontent.com/Nastasyma/mock-server-api-nastasyma/main/public/assets/images/chanterelle.jpg",
    "habitat": "Coniferous and mixed forests",
    "season": "June, August-October",
    "description": "The chanterelle mushroom has a bright yellow-orange color. That's why these mushrooms can be seen from afar, making them easy to gather. However, in the autumn, they can be easily mistaken for yellow leaves. The Chanterelle mushroom is possibly one of the best eating mushrooms in the world, in my opinion only second to the fresh penny bun otherwise known as a cep. But it does have a close look-alike. In this article, we delve into the world of the chanterelle, exploring its unique features, culinary versatility, and differentiation from its lesser-known look-alike, the False Chanterelle."
  },
  {
    "id": 3,
    "title": "Fly agaric",
    "edibility": "Poisonous",
    "image": "https://raw.githubusercontent.com/Nastasyma/mock-server-api-nastasyma/main/public/assets/images/fly-agaric.jpg",
    "habitat": "Coniferous and mixed forests",
    "season": "June-November",
    "description": "The fly agaric - a classic representative of its kind, it is this mushroom that is meant when the common name is mentioned. Fortunately, the characteristic appearance helps distinguish the fruiting bodies of this mushroom from other dangerous species. The Fly Agaric, scientifically known as Amanita muscaria, is an iconic mushroom, to say the least. It has appeared in fairy-tales, legends, on t-shirts, in artwork, and, of course, video games."
  },
  {
    "id": 4,
    "title": "Rough boletus",
    "edibility": "Edible",
    "image": "https://raw.githubusercontent.com/Nastasyma/mock-server-api-nastasyma/main/public/assets/images/rough-boletus.jpg",
    "habitat": "Deciduous and mixed forests",
    "season": "August-September",
    "description": "The rough boletus - edible autumn mushrooms with a quite attractive appearance. You can gather them almost until the snowfall. Rough boletus is widespread in deciduous or mixed forests where there are birch trees. It can also be found in tundra and forest-tundra. It may grow near dwarf birch trees. Since in such cases it can even exceed the height of the plants, the mushroom is jokingly called 'overbirch bolete'"
  },
  {
    "id": 5,
    "title": "Russula",
    "edibility": "Edible",
    "image": "https://raw.githubusercontent.com/Nastasyma/mock-server-api-nastasyma/main/public/assets/images/russula.jpg",
    "habitat": "Ubiquitous",
    "season": "June-November",
    "description": "Russula mushrooms - one of the most common mushrooms. They grow practically in any forests, both individually and in large groups. Russula is a very large genus composed of around 750 worldwide species of ectomycorrhizal mushrooms. They are typically common, fairly large, and brightly colored – making them one of the most recognizable genera among mycologists and mushroom collectors."
  },
  {
    "id": 6,
    "title": "Bracket fungus",
    "edibility": "Inedible",
    "image": "https://raw.githubusercontent.com/Nastasyma/mock-server-api-nastasyma/main/public/assets/images/bracket-fungus.jpg",
    "habitat": "Deciduous and mixed forests",
    "season": "May-October",
    "description": "The mycelium of the bracket fungus is located inside the tree, and only the fruiting bodies are visible on the surface, tightly attached to the trunk. They resemble growths on the bark. Bracket fungi, or shelf fungi, are among the many groups of fungi in the phylum Basidiomycota."
  },
  {
    "id": 7,
    "title": "Bitter bolete",
    "edibility": "Inedible",
    "image": "https://raw.githubusercontent.com/Nastasyma/mock-server-api-nastasyma/main/public/assets/images/bitter-bolete.jpg",
    "habitat": "Coniferous forests",
    "season": "June-October",
    "description": "The bitter bolete is not of interest to mushroom pickers because it cannot be consumed due to its strong bitterness. However, it is still important to know about this mushroom species to avoid mistaking it for other types."
  },
  {
    "id": 8,
    "title": "Orange-cap boletus",
    "edibility": "Edible",
    "image": "https://raw.githubusercontent.com/Nastasyma/mock-server-api-nastasyma/main/public/assets/images/orange-cap-boletus.jpg",
    "habitat": "Deciduous and mixed forests",
    "season": "June-October",
    "description": "Orange-cap boletus, edible mushroom, grows in mixed forests, its mycorrhiza is associated with birch trees. It is often found in birch forests or near birch trees. Orange-cap boletus are widespread in temperate climate zones. For example, in the central part of Russia, Siberia, the Urals, and the Far East."
  },
  {
    "id": 9,
    "title": "Saffron milk cap",
    "edibility": "Edible",
    "image": "https://raw.githubusercontent.com/Nastasyma/mock-server-api-nastasyma/main/public/assets/images/saffron-milk-cap.jpg",
    "habitat": "Young coniferous forests",
    "season": "July-October",
    "description": "The Saffron Milk Cap, formally known as Lactarius deliciosus, is a type of edible mushroom found widely distributed in Europe and parts of the United States. The mushroom is considered a delicacy in many European nations including Spain, where it is also known as Robellons, and Great Britain."
  },
  {
    "id": 10,
    "title": "Yellow boletus",
    "edibility": "Edible",
    "image": "https://raw.githubusercontent.com/Nastasyma/mock-server-api-nastasyma/main/public/assets/images/yellow-boletus.jpg",
    "habitat": "Pine and mountain forests",
    "season": "July-October",
    "description": "Yellow boletus has a hat from 6 to 21 cm. In the beginning, in young boletus, it is convex, with time it becomes pillow-shaped or open. The skin on the hat can be smooth or velvety. The pulp is quite thick, has a bright yellow tint. On the cut, the color practically does not change."
  },
  {
    "id": 11,
    "title": "Death cap",
    "edibility": "Poisonous",
    "image": "https://raw.githubusercontent.com/Nastasyma/mock-server-api-nastasyma/main/public/assets/images/death-cap.jpg",
    "habitat": "Mixed forests",
    "season": "August-November",
    "description": "Death cap is apoisonous mushroom of the family Amanitaceae (order Agaricales). It is the deadliest known mushroom to humans, responsible for the majority of mushroom poisonings worldwide, some of which prove to be fatal. Death caps are native to Europe, where they are widespread throughout the continent as well as on the British Isles."
  },
  {
    "id": 12,
    "title": "Oyster mushroom",
    "edibility": "Edible",
    "image": "https://raw.githubusercontent.com/Nastasyma/mock-server-api-nastasyma/main/public/assets/images/oyster-mushroom.jpg",
    "habitat": "Deciduous forests",
    "season": "April-October",
    "description": "Oyster mushrooms grow in an oyster or fan shape, typically in shades of white, brown, or gray, though some varieties appear in other colors. Oyster mushrooms grow on the sides of dead trees or wood, and are a widely-cultivated edible mushroom. Oyster mushrooms have cream-colored gills, short stems, and flat caps. They range in size, but are typically medium to large, with caps that grow to be between 2 and 10 inches across. Their stems are tough and woody."
  },
  {
    "id": 13,
    "title": "Champignon",
    "edibility": "Edible",
    "image": "https://raw.githubusercontent.com/Nastasyma/mock-server-api-nastasyma/main/public/assets/images/champignon.jpg",
    "habitat": "Open fields, meadows",
    "season": "May-September",
    "description": "Champignon mushrooms are far from the largest mushrooms you’ll find in the wild, but they’re not tiny either. Cremini mushrooms, or scientifically known as Agaricus bisporus, is on average about 1 to 2 inches in diameter. The mushroom is an edible mushroom that can be found growing in the grasslands of Eurasia and North America."
  },
  {
    "id": 14,
    "title": "Agaric honey",
    "edibility": "Edible",
    "image": "https://raw.githubusercontent.com/Nastasyma/mock-server-api-nastasyma/main/public/assets/images/agaric-honey.jpg",
    "habitat": "Deciduous and mixed forests",
    "season": "August-November",
    "description": "Edible mushroom honey agaric – the popular name of edible mushrooms, which include a variety of other sorts of edible mushrooms honey agarics. An interesting name of the fungus “mushrooms” was on the way in which they are growing mushrooms (huge number of species grow on stumps and fallen trees)."
  },
  {
    "id": 15,
    "title": "Capercaillie",
    "edibility": "Edible",
    "image": "https://raw.githubusercontent.com/Nastasyma/mock-server-api-nastasyma/main/public/assets/images/capercaillie.jpg",
    "habitat": "Deciduous and coniferous forests",
    "season": "May-October",
    "description": "Capercaillie mushrooms - an underestimated representative of the mushroom kingdom. Many enthusiasts of quiet hunting know nothing about it, so they pass it by and don't put it in their baskets. But this mushroom grows everywhere, it is pleasant to taste, has proven itself well in cooking, and is easily digested by the human body."
  }
]